deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
int get_wlan_config(WlanConfig_ST *wlanst)
{
    int pos = strlen(WifiConfig_Marker);
    char *buf = malloc_hexp(MaxWifiConfigLen);

    if (buf == NULL)
    {
        TRACE("get_wlan_config:no enough memory\n");
        return -1;
    }

    setdef_wlan_config(wlanst);

    flash_bytes_read(WifiConfig_Addr, buf, MaxWifiConfigLen);

    if (memcmp(WifiConfig_Marker, buf, pos) == 0)
    {
        int jsonlen = GetNumU16((uint8 *)buf + pos);
        int vlret;
        pos += 2;
        vlret = valid_wlan_config(buf + pos, jsonlen, wlanst);
        memcpy(wlanst->ipinfo.mac, gWlanNet.mac, 6);
        TRACE("get_wlan_config valid_wlan_config vlret:%d\n", vlret);
        free_hexp(buf);

        if (vlret != 0)
            setdef_wlan_config(wlanst);

        return vlret;
    }
    else
    {
        setdef_wlan_config(wlanst);
        memcpy(wlanst->ipinfo.mac, gWlanNet.mac, 6);
        TRACE("not find WifiConfig_Marker\n");
        free_hexp(buf);
        return -1;
    }
}

const uint8 DefAPAddr[] = {10, 0, 0, 1};
const uint8 DefAPSubnetMask[] = {255, 255, 255, 0};
const uint8 DefAPGateWay[] = {0, 0, 0, 0};
const uint8 DefAPDns[] = {0, 0, 0, 0};
#define DefAPSSID "UHF-Reader"

void setdef_wlan_config(WlanConfig_ST *wlanst)
{
    memcpy(wlanst->ipinfo.ip, DefAPAddr, 4);
    memcpy(wlanst->ipinfo.subnetMask, DefAPSubnetMask, 4);
    memcpy(wlanst->ipinfo.gatewayIP, DefAPGateWay, 4);
    memcpy(wlanst->ipinfo.dnsServer, DefAPDns, 4);
    wlanst->ipinfo.listenPort = DefTcpPort;
    wlanst->mode = Wlan_WMode_AP;
    strcpy(wlanst->ssid, DefAPSSID);
    wlanst->pwd[0] = 0;
}

#if IS_RTOS2_SUPPORT
#define PARSE_CHK_IN_TAB(elm, name, item, tab, exist) \
    do { \
        if (json_getint(elm, name, &pvalint) == 0) \
        { \
            if (is_in_inttab(tab, sizeof(tab)/4, pvalint) == 0) \
            { \
                TRACE("%s is invalid\n", #name); \
                return -1;	\
            } \
            else \
                item = pvalint; \
        } \
        else \
        { \
            if (exist == 1) \
            { \
                TRACE("%s dose not find\n", #name); \
                return -1; \
            } \
        } \
    } while (0)


#define PARSE_CHK_RANGE(obj, name, item, min, max, exist) \
    do { \
        exflag = 0; \
        if (json_getint(obj, name, &pvalint) == 0) \
        { \
            if (pvalint < min || pvalint > max) \
            { \
                TRACE("%s is invalid\n", #name); \
                return -1;	\
            } \
            else \
            { \
                exflag = 1; \
                item = pvalint; \
            } \
        } \
        else \
        { \
            if (exist == 1) \
            { \
                TRACE("%s dose not find\n", #name); \
                return -1; \
            } \
        } \
    } while (0)

#define PARSE_CHK_STR(obj, name, item, len, exist, canempty) \
    do { \
        exflag = 0; \
        if (json_getstring_len(obj, name, len, 2, item) != 0) \
        { \
            if (exist == 1) \
            { \
                TRACE("%s dose not find\n", #name); \
                return -1; \
            } \
        } \
        else \
        { \
            if (item[0] == 0 && canempty == 0) \
            { \
                TRACE("%s len is invalid\n", #name); \
                return -1; \
            } \
            exflag = 1; \
        } \
    } while (0)

int is_in_inttab(int *tab, int len, int val)
{
    int i;

    for (i = 0; i < len; ++i)
    {
        if (val == tab[i])
            return 1;
    }

    return 0;
}

int valid_ipinfo_cfg(json_value *obj, networkParaConfig *ipinfo)
{
    char strbuf[30];
    int pvalint;
    int exflag;

    PARSE_CHK_STR(obj, "ip", strbuf, 29, 1, 0);

    if (addr_str2bin(strbuf, ipinfo->ip) != 0)
    {
        TRACE("ip format error\n");
        return -1;
    }

    PARSE_CHK_STR(obj, "nm", strbuf, 29, 1, 0);

    if (addr_str2bin(strbuf, ipinfo->subnetMask) != 0)
    {
        TRACE("nm format error\n");
        return -1;
    }

    PARSE_CHK_STR(obj, "gw", strbuf, 29, 1, 0);

    if (addr_str2bin(strbuf, ipinfo->gatewayIP) != 0)
    {
        TRACE("gw format error\n");
        return -1;
    }

    PARSE_CHK_STR(obj, "dns", strbuf, 29, 0, 0);

    if (exflag)
    {
        if (addr_str2bin(strbuf, ipinfo->dnsServer) != 0)
        {
            TRACE("dns format error\n");
            return -1;
        }
    }

    PARSE_CHK_STR(obj, "mac", strbuf, 29, 0, 0);

    if (exflag)
    {
        if (strlen(strbuf) != 12)
        {
            TRACE("mac len must be 12\n");
            return -1;
        }

        uint8 machex[6];

        if (strTohex(strbuf, 12, machex) != 0)
        {
            TRACE("mac format error\n");
            return -1;
        }

        if (!(machex[0] == 0xff && machex[1] == 0xff &&
                machex[2] == 0xff && machex[3] == 0xff &&
                machex[4] == 0xff && machex[5] == 0xff ))
            memcpy(ipinfo->mac, machex, 6);
    }

    PARSE_CHK_RANGE(obj, "lport", ipinfo->listenPort, 100, 65530, 0);
    return 0;
}

int valid_wlan_config_byobj(json_value *jvalue, WlanConfig_ST *wlanst)
{
    int pvalint;
    int exflag;

    if (valid_ipinfo_cfg(jvalue, &wlanst->ipinfo) != 0)
    {
        TRACE("ipinfo is invalid\n");
        return -1;
    }

    PARSE_CHK_RANGE(jvalue, "mode", wlanst->mode, 1, 2, 1);

    if (wlanst->mode == Wlan_WMode_AP)
    {
        if (wlanst->ipinfo.ip[0] == 0 && wlanst->ipinfo.ip[1] == 0 &&
                wlanst->ipinfo.ip[2] == 0 && wlanst->ipinfo.ip[3] == 0)
        {
            TRACE("dhcp dose not allow with ap mode\n");
            return -1;
        }
    }

    PARSE_CHK_STR(jvalue, "ssid", wlanst->ssid, 32, 1, 0);
    /*
    PARSE_CHK_RANGE(jvalue, "auth", wlanst->auth, 0, 3, 1);

    PARSE_CHK_RANGE(jvalue, "encry", wlanst->encry, 0, 4, 1);
    if (wlanst->encry == Wlan_Encry_NONE)
    {
    	if (wlanst->auth != Wlan_Auth_OPEN)
    	{
    		TRACE("auth should be Wlan_Auth_OPEN\n");
    		return -1;
    	}
    }
    else if (wlanst->encry == Wlan_Encry_TKIP ||
    	wlanst->encry == Wlan_Encry_AES)
    {
    	if (!(wlanst->auth == Wlan_Auth_WPAPSK ||
    		wlanst->auth == Wlan_Auth_WPA2PSK))
    	{
    		TRACE("auth should be Wlan_Auth_WPAPSK or Wlan_Auth_WPA2PSK\n");
    		return -1;
    	}
    }
    else if (wlanst->encry == Wlan_Encry_WEP_A ||
    	wlanst->encry == Wlan_Encry_WEP_H)
    {
    	if (wlanst->auth != Wlan_Auth_SHARED)
    	{
    		TRACE("auth should be Wlan_Auth_SHARED\n");
    		return -1;
    	}
    }
    */
    PARSE_CHK_STR(jvalue, "pwd", wlanst->pwd, 64, 0, 1);

    if (!exflag)
        wlanst->pwd[0] = 0;

