deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
    /*
    keylen = strlen(wlanst->key);
    if (keylen == 0)
    {
    	if (wlanst->auth != Wlan_Auth_OPEN)
    	{
    		TRACE("key is none, auth is not Wlan_Auth_OPEN\n");
    		return -1;
    	}
    }
    else
    {
    	if (wlanst->auth == Wlan_Auth_WPAPSK ||
    			wlanst->auth == Wlan_Auth_WPA2PSK)
    	{
    		if (keylen < 8)
    		{
    			TRACE("key len is invalid, less than 8\n");
    			return -1;
    		}
    	}
    	else
    	{
    		if (wlanst->encry == Wlan_Encry_WEP_A)
    		{
    			if (!(keylen == 5 || keylen == 13))
    			{
    				TRACE("key len is invalid, should be 5 or 13\n");
    				return -1;
    			}
    		}
    		else if (wlanst->encry == Wlan_Encry_WEP_H)
    		{
    			if (keylen == 10 || keylen == 26)
    			{
    				int i;
    				for (i = 0; i < keylen; ++i)
    				{
    					if (!((wlanst->key[i] >= '0' &&  wlanst->key[i] <= '9') ||
    						(wlanst->key[i] >= 'A' &&  wlanst->key[i] <= 'F')))
    					{
    						TRACE("key should be hex string\n");
    						return -1;
    					}
    				}
    			}
    			else
    			{
    				TRACE("key len is invalid, should be 10 or 26\n");
    				return -1;
    			}
    		}
    	}
    }*/
    return 0;
}

#endif

int get_json_field(char *buf, char *field, int type, char *strbuf)
{
    char *tmp1,*tmp2;
    char field_[50];

    sprintf(field_, "\"%s\":", field);
    tmp1 = strstr(buf, field_);

    if (tmp1 == NULL)
        return -1;

    if (type == 1)
    {
        tmp2 = strstr(tmp1 + strlen(field_) +1, "\"");

        if (tmp1 == NULL)
            return -1;

        memcpy(strbuf, tmp1 + strlen(field_) +1, tmp2 - (tmp1 + strlen(field_) +1));
        strbuf[tmp2 - (tmp1 + strlen(field_) +1)] = 0;
    }
    else if (type == 2)
    {
        tmp2 = strstr(tmp1 + strlen(field_), ",");

        if (tmp1 == NULL)
            return -1;

        memcpy(strbuf, tmp1 + strlen(field_), tmp2 - (tmp1 + strlen(field_)));
        strbuf[tmp2 - (tmp1 + strlen(field_))] = 0;
    }
    else
        return -1;

    return 0;
}

int valid_wlan_config(char *buf, int blen, WlanConfig_ST *wlanst)
{
    #if IS_RTOS2_SUPPORT
    json_value *jvalue;

    jvalue = json_parse_auto(buf, blen);

    if (jvalue == NULL)
    {
        TRACE("valid_wlan_config jvalue == NULL\n");
        return -1;
    }

    return valid_wlan_config_byobj(jvalue, wlanst);
    #else
    char strbuf[100];

    buf[blen] = 0;

//	TRACE("valid_wlan_config:%s\n", buf);
    if (get_json_field(buf, "ip", 1, strbuf) == 0)
    {
        if (addr_str2bin(strbuf, wlanst->ipinfo.ip) != 0)
        {
            TRACE("ip format error\n");
            return -1;
        }
    }
    else
        return -1;

    if (get_json_field(buf, "nm", 1, strbuf) == 0)
    {
        if (addr_str2bin(strbuf, wlanst->ipinfo.subnetMask) != 0)
        {
            TRACE("nm format error\n");
            return -1;
        }
    }
    else
        return -1;

    if (get_json_field(buf, "gw", 1, strbuf) == 0)
    {
        if (addr_str2bin(strbuf, wlanst->ipinfo.gatewayIP) != 0)
        {
            TRACE("gw format error\n");
            return -1;
        }
    }
    else
        return -1;

    if (get_json_field(buf, "dns", 1, strbuf) == 0)
    {
        if (addr_str2bin(strbuf, wlanst->ipinfo.dnsServer) != 0)
        {
            TRACE("dns format error\n");
            return -1;
        }
    }
    else
        return -1;

    if (get_json_field(buf, "lport", 2, strbuf) == 0)
        wlanst->ipinfo.listenPort = atoi_Arm(strbuf);
    else
        return -1;

    if (get_json_field(buf, "mode", 2, strbuf) == 0)
        wlanst->mode = atoi_Arm(strbuf);
    else
        return -1;

    if (wlanst->mode == Wlan_WMode_AP)
    {
        if (wlanst->ipinfo.ip[0] == 0 && wlanst->ipinfo.ip[1] == 0 &&
                wlanst->ipinfo.ip[2] == 0 && wlanst->ipinfo.ip[3] == 0)
        {
            TRACE("dhcp dose not allow with ap mode\n");
            return -1;
        }
    }

    if (get_json_field(buf, "ssid", 1, wlanst->ssid) != 0)
        return -1;

    if (get_json_field(buf, "pwd", 1, wlanst->pwd) != 0)
        wlanst->pwd[0] = 0;

    return 0;
    #endif
}

extern uint8 gBleMac[6];
int get_bluetooth_config(BluetoothConfig_ST *blest)
{
    int pos = strlen(BluetoothConfig_Marker);
    char *buf = malloc_hexp(MaxBluetoothConfigLen);

    if (buf == NULL)
    {
        TRACE("get_bluetooth_config:no enough memory\n");
        return -1;
    }

    memcpy(blest->mac, gBleMac, 6);
    setdef_bluetooth_config(blest);
    flash_bytes_read(BluetoothConfig_Addr, buf, MaxBluetoothConfigLen);

    if (memcmp(BluetoothConfig_Marker, buf, pos) == 0)
    {
        int jsonlen = GetNumU16((uint8 *)buf + pos);
        int vlret;
        pos += 2;
        vlret = valid_bluetooth_config(buf + pos, jsonlen, blest);
        memcpy(blest->mac, gBleMac, 6);
        TRACE("get_bluetooth_config valid_bluetooth_config vlret:%d\n", vlret);
        free_hexp(buf);

        if (vlret != 0)
            setdef_bluetooth_config(blest);

        return vlret;
    }
    else
    {
        setdef_bluetooth_config(blest);
        memcpy(blest->mac, gBleMac, 6);
        TRACE("not find BluetoothConfig_Marker\n");
        free_hexp(buf);
        return -1;
    }
}

void setdef_bluetooth_config(BluetoothConfig_ST *blest)
{
    strcpy(blest->name, "UHF-Reader");
    blest->std_ble_pair = 0;
    blest->pwd_pair = 0;
}

void dump_monet_config(MonetConfig_ST *monst)
{
    #ifdef _DEBUG
    TRACE("dump_monet_config start\n");
    TRACE("apn_name:%s\n", monst->apn.name);
    TRACE("apn_user:%s\n", monst->apn.user);
    TRACE("apn_pwd:%s\n", monst->apn.pwd);

    TRACE("apn_auth:%d\n", monst->apn.auth);
    TRACE("apn_cid:%d\n", monst->apn.cid);
    TRACE("apn_enable:%d\n", monst->apn.enable);
    TRACE("dump_monet_config end\n");
    #endif
}

int erase_bluetooth_config(void)
{
    int err = 0;
    ConfReadBuffer confBuf;
    E(pre_set_config(&confBuf));
    memset(confBuf.bluetoothcfgbuf, 0, 32);
    E(set_config_to_flash(&confBuf));
FIN:
    return err;
}

#if IS_RTOS2_SUPPORT
int valid_monet_config_byobj(json_value *jvalue,
                             MonetConfig_ST *monst)
{
    int pvalint;
    int exflag;
    json_value *apnobj;

