deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
    if (json_getobject(jvalue, "apn", &apnobj) == 0)
    {
        PARSE_CHK_STR(apnobj, "name", monst->apn.name, (MONET_APN_NAME_LEN - 1), 1, 0);

        PARSE_CHK_STR(apnobj, "user", monst->apn.user, (MONET_APN_USER_LEN - 1), 0, 1);

        PARSE_CHK_STR(apnobj, "pwd", monst->apn.pwd, (MONET_APN_PWD_LEN - 1), 0, 1);

        if (exflag == 1)
            monst->apn.pwd[MONET_APN_PWD_LEN - 1] = 0;

        PARSE_CHK_RANGE(apnobj, "auth", monst->apn.auth, 0, 2, 0);

        PARSE_CHK_RANGE(apnobj, "cid", monst->apn.cid, 0, 6, 0);

        PARSE_CHK_RANGE(apnobj, "enable", monst->apn.enable, 0, 1, 0);
    }

    return 0;
}

int valid_bluetooth_config_byobj(json_value *jvalue,
                                 BluetoothConfig_ST *blest)
{
    int pvalint;
    int exflag;

    PARSE_CHK_STR(jvalue, "name", blest->name, 20, 0, 0);

    PARSE_CHK_RANGE(jvalue, "std_ble_pair", blest->std_ble_pair, 0, 1, 0);

    PARSE_CHK_RANGE(jvalue, "pwd_pair", blest->pwd_pair, 0, 1, 0);

    if (blest->pwd_pair == 1)
    {
        PARSE_CHK_STR(jvalue, "pwd", blest->pwd, 6, 1, 0);

        if (exflag == 1)
            blest->pwd[6] = 0;
    }

    return 0;
}

#endif

void setdef_monet_config(MonetConfig_ST *monst)
{
    strcpy(monst->apn.name, "CMNET");
    monst->apn.user[0] = 0;
    monst->apn.pwd[0] = 0;
    monst->apn.auth = 0;
    monst->apn.cid = 1;
    monst->apn.enable = 0;
}

int get_monet_config(MonetConfig_ST *monst)
{
    int pos = strlen(MonetConfig_Marker);
    char *buf = malloc_hexp(MaxMonetConfigLen);

    if (buf == NULL)
    {
        TRACE("get_monet_config:no enough memory\n");
        return -1;
    }

    setdef_monet_config(monst);
    flash_bytes_read(MonetConfig_Addr, buf, MaxMonetConfigLen);

    if (memcmp(MonetConfig_Marker, buf, pos) == 0)
    {
        int jsonlen = GetNumU16((uint8 *)buf + pos);
        int vlret;
        pos += 2;
        vlret = valid_monet_config(buf + pos, jsonlen, monst);
        TRACE("get_monet_config valid_monet_config vlret:%d\n", vlret);
        free_hexp(buf);

        if (vlret != 0)
            setdef_monet_config(monst);

        return vlret;
    }
    else
    {
        setdef_monet_config(monst);
        TRACE("not find MonetConfig_Marker\n");
        free_hexp(buf);
        return -1;
    }
}

int valid_monet_config(char *buf, int blen, MonetConfig_ST *monst)
{
    #if IS_RTOS2_SUPPORT
    json_value *jvalue;

    jvalue = json_parse_auto(buf, blen);

    if (jvalue == NULL)
    {
        TRACE("valid_monet_config jvalue == NULL\n");
        return -1;
    }

    return valid_monet_config_byobj(jvalue, monst);
    #else
    char strbuf[100];

    if (get_json_field(buf, "name", 1, monst->apn.name) == 0)
        return -1;

    if (get_json_field(buf, "user", 1, monst->apn.user) == 0)
        return -1;

    if (get_json_field(buf, "pwd", 1, monst->apn.user) == 0)
        return -1;

    if (get_json_field(buf, "auth", 2, strbuf) == 0)
        monst->apn.auth = atoi_Arm(strbuf);
    else
        return -1;

    if (get_json_field(buf, "cid", 2, strbuf) == 0)
        monst->apn.cid = atoi_Arm(strbuf);
    else
        return -1;

    if (get_json_field(buf, "enable", 2, strbuf) == 0)
        monst->apn.enable = atoi_Arm(strbuf);
    else
        return -1;

    return 0;
    #endif
}

int valid_bluetooth_config(char *buf, int blen, BluetoothConfig_ST *blest)
{
    #if IS_RTOS2_SUPPORT
    json_value *jvalue;

    jvalue = json_parse_auto(buf, blen);

    if (jvalue == NULL)
    {
        TRACE("valid_bluetooth_config jvalue == NULL\n");
        return -1;
    }

    return valid_bluetooth_config_byobj(jvalue, blest);
    #else
    char strbuf[100];

    if (get_json_field(buf, "name", 1, blest->name) == 0)
        return -1;

    if (get_json_field(buf, "std_ble_pair", 2, strbuf) == 0)
        blest->std_ble_pair = atoi_Arm(strbuf);
    else
        return -1;

    if (get_json_field(buf, "pwd_pair", 2, strbuf) == 0)
        blest->pwd_pair = atoi_Arm(strbuf);
    else
        return -1;

    if (blest->pwd_pair == 1)
    {
        if (get_json_field(buf, "pwd", 1, blest->name) != 0)
            blest->pwd[6] = 0;
    }

    return 0;
    #endif
}

#if IS_RTOS2_SUPPORT
const char *ACPMagicStr = "StdModeActParam";

int get_active_mode_config(AppCustomParams *pACP)
{
    unsigned char *pConf;
    int pos = 0;
    int i;
    uint8 *actcfgbuf = malloc_hexp(MaxActiveModeConfigLen);

    if (actcfgbuf == NULL)
    {
        TRACE("get_active_mode_config:no enough memory\n");
        return -1;
    }

    flash_bytes_read(ActiveModeConfig_Addr, actcfgbuf, MaxActiveModeConfigLen);

    memset(pACP, 0, sizeof(AppCustomParams));

    if (memcmp(actcfgbuf, ACPMagicStr, 15) != 0)
    {
        free_hexp(actcfgbuf);
        return -1;
    }

    pConf = actcfgbuf + 17;


    if (!(pConf[pos] == 0xFF && pConf[pos + 1] == 0x00))
    {
        free_hexp(actcfgbuf);
        return -1;
    }

    pos += 2;

    pACP->name_len = pConf[pos++];
    memcpy(pACP->name, pConf + pos, pACP->name_len);
    pACP->name[pACP->name_len] = 0;
    pos += pACP->name_len;
    pACP->rpwrs_len = pConf[pos++];

    for (i = 0; i < pACP->rpwrs_len; ++i)
    {
        pACP->rpwrs[i] = GetNumU16(pConf + pos);
        pos += 2;
    }

    pACP->region = pConf[pos++];
    pACP->hoptab_len = pConf[pos++];

    for (i = 0; i < pACP->hoptab_len; ++i)
    {
        pACP->frepoints[i] = GetNumU32(pConf + pos);
        pos += 4;
    }

    pACP->gen2session = pConf[pos++];
    pACP->gen2q = pConf[pos++];
    pACP->is_tagdata_uni_byant = pConf[pos++];
    pACP->is_tagdata_uni_bybank = pConf[pos++];
    pACP->is_record_max_rssi = pConf[pos++];

    pos += 3;
    pACP->invants_len = pConf[pos++];

    for (i = 0; i < pACP->invants_len; ++i)
        pACP->inv_ants[i] = pConf[pos++];

    pACP->heart_beat_cylce = GetNumU16(pConf + pos);
    pos += 2;

    pACP->is_tagfilter = pConf[pos++];

    if (pACP->is_tagfilter == 1)
    {
        pACP->tag_filter.bank = pConf[pos++];
        pACP->tag_filter.start_bit = GetNumU16(pConf + pos);
        pos += 2;
        pACP->tag_filter.mask_len = GetNumU16(pConf + pos);
        pos += 2;
        {
            int maskbytecnt = (pACP->tag_filter.mask_len % 8 == 0) ? (pACP->tag_filter.mask_len / 8) :
                              ((pACP->tag_filter.mask_len / 8) + 1);
            memcpy(pACP->tag_filter.mask, pConf + pos, maskbytecnt);
            pos += maskbytecnt;
        }

