deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
        if (pACP->gpi_trigger_mode == 1 || pACP->gpi_trigger_mode == 3 ||
                pACP->gpi_trigger_mode == 4)
        {
            TRACE("gpi_trigger2:\n");

            for (i = 0; i < pACP->gpi_trigger2.gpi_count; ++i)
                TRACE("    gpi_id:%d, gpi_state:%d\n", pACP->gpi_trigger2.gpi_ids[i], pACP->gpi_trigger2.gpi_states[i]);
        }

        TRACE("gpi_read_timeout:%d\n", pACP->gpi_read_timeout);
    }

    TRACE("gpo init state:%02X\n", pACP->gpo_init_states);
    TRACE("local gpo action count:%d\n", pACP->loc_gpo_act_count);

    for (i = 0; i < pACP->loc_gpo_act_count; ++i)
    {
        TRACE("gpo%d state:%d dur:%d", pACP->lga_gpo_id[i],
              pACP->lga_gpo_states[i], pACP->lga_gpo_durs[i]);
        TRACE("--");
    }

    TRACE("\n");

    TRACE("event_count:%d\n", pACP->event_count);

    for (i = 0; i < pACP->event_count; ++i)
        printf("%d ", pACP->events[i]);

    TRACE("\ninv_cycle:%d\n", pACP->inv_cycle);
    TRACE("interval_cycle:%d\n", pACP->interval_cycle);
    TRACE("max_rec_databytes_length:%d\n", pACP->max_rec_databytes_length);
    TRACE("cusparam:%s", pACP->cusparam);

    TRACE("\nDumpAppCustomParams end----------------------\n");
    #endif
}

void setdef_active_mode_config(AppCustomParams *pACP)
{
    memset(pACP, 0, sizeof(AppCustomParams));
    strcpy((char*)pACP->name, "arm7Reader");
    pACP->name_len = strlen("arm7Reader");
    pACP->data_aggr_duration = 2000;
    pACP->gen2q = 255;
    pACP->heart_beat_cylce = 10;
    pACP->interval_cycle = 10;
    pACP->inv_cycle = 150;
    pACP->region = 1;
    pACP->max_rec_databytes_length = 32;
    pACP->upload_ip[0] = 169;
    pACP->upload_ip[1] = 169;
    pACP->upload_ip[2] = 169;
    pACP->upload_ip[3] = 169;
    pACP->upload_port = 12345;
    pACP->loc_gpo_act_count = 0;
    pACP->gpo_init_states = 0x0F;
}

void AppCustomParams_To_static_settings(AppCustomParams *pAppCusPara,
                                        ReaderStaticSettings_ST *static_set)
{
    int i;
    static_set->protocol.gen2.session = pAppCusPara->gen2session;
    static_set->rf.region = pAppCusPara->region;
    static_set->app_init.max_tb_rec_len = pAppCusPara->max_rec_databytes_length;

    static_set->tagops_param.inventory.ants_cnt = pAppCusPara->invants_len;

    for (i = 0; i < pAppCusPara->invants_len; ++i)
        static_set->tagops_param.inventory.ants[i] = pAppCusPara->inv_ants[i];

    static_set->tagops_param.inventory.cycle = pAppCusPara->inv_cycle;
    static_set->tagops_param.inventory.interval = pAppCusPara->interval_cycle;
    static_set->tagops_param.inventory.inv_mode = -1;

    static_set->tagops_param.tagfilter.is_tagfilter = pAppCusPara->is_tagfilter;

    if (pAppCusPara->is_tagfilter == 1)
    {
        static_set->tagops_param.tagfilter.bank = pAppCusPara->tag_filter.bank;
        static_set->tagops_param.tagfilter.mask_len = pAppCusPara->tag_filter.mask_len;
        static_set->tagops_param.tagfilter.match = pAppCusPara->tag_filter.is_match;
        memcpy(static_set->tagops_param.tagfilter.mask, pAppCusPara->tag_filter.mask, 64);
        static_set->tagops_param.tagfilter.start = pAppCusPara->tag_filter.start_bit;
    }

    static_set->tagops_param.bankdata.is_bankdata = pAppCusPara->is_inv_bank_read;

    if ( pAppCusPara->is_inv_bank_read == 1)
    {
        static_set->tagops_param.bankdata.bank = pAppCusPara->inv_bank_read.bank;
        static_set->tagops_param.bankdata.blkcnt = pAppCusPara->inv_bank_read.blockcnt;
        static_set->tagops_param.bankdata.start = pAppCusPara->inv_bank_read.start_block;
        memcpy(static_set->tagops_param.accessop.aespwd, pAppCusPara->inv_bank_read.pwd, 4);
    }
    else
        SetNumU32(static_set->tagops_param.accessop.aespwd, 0);

    if (pAppCusPara->rpwrs_len == 0)
    {
        for (i = 0; i < pAppCusPara->rpwrs_len; ++i)
        {
            static_set->rf.tx_powers[i].read_power = -1;
            static_set->rf.tx_powers[i].write_power = -1;
        }
    }
    else
    {
        if (pAppCusPara->rpwrs_len == 1)
        {
            for (i = 0; i < 16; ++i)
            {
                static_set->rf.tx_powers[i].read_power = pAppCusPara->rpwrs[0];
                static_set->rf.tx_powers[i].write_power = pAppCusPara->rpwrs[0];
            }
        }
        else
        {
            for (i = 0; i < pAppCusPara->rpwrs_len; ++i)
            {
                static_set->rf.tx_powers[i].read_power = pAppCusPara->rpwrs[i];
                static_set->rf.tx_powers[i].write_power = pAppCusPara->rpwrs[i];
            }
        }
    }

    static_set->tag_data.unique_by_antenna = pAppCusPara->is_tagdata_uni_byant;
    static_set->tag_data.unique_by_bank_data = pAppCusPara->is_tagdata_uni_bybank;
    static_set->tag_data.record_highest_rssi = pAppCusPara->is_record_max_rssi;

    if (pAppCusPara->gpo_init_states > 0)
        static_set->gpos[i] = ((pAppCusPara->gpo_init_states >> i) & 0x1) + 1;

    if (pAppCusPara->upload_ip[0] == 0)
    {
        static_set->uart1.baud = (pAppCusPara->upload_ip[1] << 16) |
                                 (pAppCusPara->upload_ip[2] << 8) | pAppCusPara->upload_ip[3];
        static_set->uart1.data_bits = 0;
        static_set->uart1.stop_bits = 0;
        static_set->uart1.parity = 0;
        static_set->uart1.flow_ctrl = 0;
        static_set->uart1.type = 0;
    }
}


void setdef_rdr_static_settings(ReaderStaticSettings_ST *static_set)
{
    int i;

    static_set->is_ethernet = 0;
    static_set->uart_ex_type = 0;

    static_set->app_init.usb_type = rdr_st_set_usb_type_HidCdc;
    static_set->app_init.max_tb_rec_len = MaxTbItemSize;
    static_set->app_init.evt_que_len = DefEvtQueSize;
    static_set->reboot = 1;

    static_set->tagops_param.inventory.ants_cnt = 0;
    static_set->tagops_param.inventory.cycle = 150;
    static_set->tagops_param.inventory.interval = 10;
    static_set->tagops_param.inventory.inv_mode = 0;
    static_set->tagops_param.tagfilter.is_tagfilter = 0;
    static_set->tagops_param.bankdata.is_bankdata = 0;
    static_set->tagops_param.accessop.ant = 0;
    static_set->tagops_param.accessop.timeout = 1000;
    SetNumU32(static_set->tagops_param.accessop.aespwd, 0);

