deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
    static_set->tagops_param.mb_sinv_tag_fmt = 0x01;

    static_set->protocol.gen2.session = -1;
    static_set->protocol.gen2.q = -2;
    static_set->protocol.gen2.target = -1;
    static_set->protocol.gen2.profile = -1;
    static_set->rf.ant_max_dwell_time = 0;
    static_set->rf.hop_mode = -1;
    static_set->rf.region = -1;
    static_set->rf.hop_table_cnt = 0;

    for (i = 0; i < 16; ++i)
    {
        static_set->rf.tx_powers[i].read_power = -2;
        static_set->rf.tx_powers[i].write_power = -2;
    }

    static_set->tag_data.unique_by_antenna = -1;
    static_set->tag_data.unique_by_bank_data = -1;
    static_set->tag_data.record_highest_rssi = -1;

    for (i = 0; i < 5; ++i)
        static_set->gpos[i] = 0;


    static_set->uart1.baud = 115200;   /* v9.81s-g: unify OTA port */
    static_set->uart1.data_bits = 0;
    static_set->uart1.parity = 0;
    static_set->uart1.type = 0;
    static_set->uart1.address = 2;
    static_set->uart1.stop_bits = 0;
    static_set->uart1.flow_ctrl = 0;

    static_set->uart2.baud = 115200;
    static_set->uart2.data_bits = 0;
    static_set->uart2.parity = 0;
    static_set->uart2.type = 1;
    static_set->uart2.address = 2;
    static_set->uart2.stop_bits = 0;
    static_set->uart2.flow_ctrl = 0;
}

void dump_static_settings(ReaderStaticSettings_ST *static_set)
{
    #ifdef _DEBUG
    int i;
    TRACE("----------------------- dump_static_settings start\n");
    TRACE("reboot:%d\n", static_set->reboot);

    TRACE("inventory.cycle:%d\n", static_set->tagops_param.inventory.cycle);
    TRACE("inventory.interval:%d\n", static_set->tagops_param.inventory.interval);
    TRACE("inventory.inv_mode:%d\n", static_set->tagops_param.inventory.inv_mode);
    TRACE("inventory.ants:");

    for (i = 0; i < static_set->tagops_param.inventory.ants_cnt; ++i)
        printf("%d ", static_set->tagops_param.inventory.ants[i]);

    TRACE("\n");

    if (static_set->tagops_param.tagfilter.is_tagfilter == 1)
    {
        TRACE("tagfilter.bank:%d\n", static_set->tagops_param.tagfilter.bank);
        TRACE("tagfilter.start:%d\n", static_set->tagops_param.tagfilter.start);
        TRACE("tagfilter.match:%d\n", static_set->tagops_param.tagfilter.match);
        TRACE("tagfilter.mask_len:%d\n", static_set->tagops_param.tagfilter.mask_len);
        TRACE("tagfilter.mask:");

        for (i = 0; i < static_set->tagops_param.tagfilter.mask_len / 8 + 1; ++i)
            TRACE("%02X ", static_set->tagops_param.tagfilter.mask[i]);

        TRACE("\n");
        TRACE("\n");
    }

    if (static_set->tagops_param.bankdata.is_bankdata == 1)
    {
        TRACE("bankdata.bank:%d\n", static_set->tagops_param.bankdata.bank);
        TRACE("bankdata.start:%d\n", static_set->tagops_param.bankdata.start);
        TRACE("bankdata.blkcnt:%d\n", static_set->tagops_param.bankdata.blkcnt);
//		printf("bankdata.pwd:%08X\n", GetNumU32(rt_set->bankdata.pwd));
    }

    TRACE("accessop: ant:%d, timeout:%d, pwd:%04X\n", static_set->tagops_param.accessop.ant,
          static_set->tagops_param.accessop.timeout,
          GetNumU32(static_set->tagops_param.accessop.aespwd));

    TRACE("tagops_param.mb_sinv_tag_fmt:%04X\n", static_set->tagops_param.mb_sinv_tag_fmt);

    TRACE("app_init.usb_type:%d\n", static_set->app_init.usb_type);
    TRACE("app_init.max_tb_rec_len:%d\n", static_set->app_init.max_tb_rec_len);
    TRACE("app_init.evt_que_len:%d\n", static_set->app_init.evt_que_len);

    TRACE("protocol.gen2.session:%d\n", static_set->protocol.gen2.session);
    TRACE("protocol.gen2.q:%d\n", static_set->protocol.gen2.q);
    TRACE("protocol.gen2.target:%d\n", static_set->protocol.gen2.target);
    TRACE("protocol.gen2.profile:%d\n", static_set->protocol.gen2.profile);

    TRACE("rf.ant_max_dwell_time:%d\n", static_set->rf.ant_max_dwell_time);
    TRACE("rf.hop_mode:%d\n", static_set->rf.hop_mode);
    TRACE("rf.region:%d\n", static_set->rf.region);

    if (static_set->rf.hop_table_cnt != 0)
    {
        TRACE("hoptable:");

        for (i = 0; i < static_set->rf.hop_table_cnt; ++i)
        {
            TRACE("%d ", static_set->rf.hop_table[i]);
        }

        TRACE("\n");
    }

    TRACE("tx_powers:");

    for (i = 0; i < 16; ++i)
    {
        if (static_set->rf.tx_powers[i].read_power != 0)
        {
            TRACE("%d %d ", i + 1, static_set->rf.tx_powers[i].read_power);
            TRACE("%d, ", static_set->rf.tx_powers[i].write_power);
        }
    }

    TRACE("\n");


    TRACE("tag_data.unique_by_antenna:%d\n", static_set->tag_data.unique_by_antenna);
    TRACE("tag_data.unique_by_bank_data:%d\n", static_set->tag_data.unique_by_bank_data);
    TRACE("tag_data.record_highest_rssi:%d\n", static_set->tag_data.record_highest_rssi);

    TRACE("gpos:");

    for (i = 0; i < 5; ++i)
        TRACE("%d %d, ", i + 1, static_set->gpos[i]);

    TRACE("\n");


    TRACE("uart1.address:%d\n", static_set->uart1.address);
    TRACE("uart1.baud:%d\n", static_set->uart1.baud);
    TRACE("uart1.data_bits:%d\n", static_set->uart1.data_bits);
    TRACE("uart1.stop_bits:%d\n", static_set->uart1.stop_bits);
    TRACE("uart1.flow_ctrl:%d\n", static_set->uart1.flow_ctrl);
    TRACE("uart1.parity:%d\n", static_set->uart1.parity);
    TRACE("uart1.type:%d\n", static_set->uart1.type);

    TRACE("uart2.address:%d\n", static_set->uart2.address);
    TRACE("uart2.baud:%d\n", static_set->uart2.baud);
    TRACE("uart2.data_bits:%d\n", static_set->uart2.data_bits);
    TRACE("uart2.stop_bits:%d\n", static_set->uart2.stop_bits);
    TRACE("uart2.flow_ctrl:%d\n", static_set->uart2.flow_ctrl);
    TRACE("uart2.parity:%d\n", static_set->uart2.parity);
    TRACE("uart2.type:%d\n", static_set->uart2.type);

    if (static_set->is_ethernet == 1)
        dump_network_config(&static_set->ethernet);

    if (static_set->uart_ex_type == Uart_Ex_Wlan)
        dump_wlan_config(&static_set->uart_ex.wlan);

    if (static_set->uart_ex_type == Uart_Ex_Bluetooth)
        dump_bluetooth_config(&static_set->uart_ex.ble);

    if (static_set->uart_ex_type == Uart_Ex_4G)
        dump_monet_config(&static_set->uart_ex.monet);

    TRACE("----------------------- dump_static_settings end\n");
    #endif
}


