deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
    rt_set->reset = 0;
    PARSE_CHK_RANGE(jvalue, "reset", rt_set->reset, 0, 1, 0);

    if (json_getobject(jvalue, "glob_params", &obj) == 0)
    {
        PARSE_CHK_RANGE(obj, "hb_cylce", rt_set->glob_params.hb_cylce, 1, 0xffff, 0);

        PARSE_CHK_RANGE(obj, "s_buf_size", rt_set->glob_params.s_buf_size, 1500, 8192, 0);

        PARSE_CHK_STR(obj, "name", rt_set->glob_params.name, 128, 0, 0);
    }

    if (json_getobject(jvalue, "upload", &obj) == 0)
    {
        PARSE_CHK_RANGE(obj, "client_ack", rt_set->upload.client_ack, 0, 1, 0);

        PARSE_CHK_RANGE(obj, "crc_enable", rt_set->upload.crc_enable, 0, 1, 0);

        PARSE_CHK_RANGE(obj, "recv_timeout", rt_set->upload.recv_timeout, 5, 60, 0);

        PARSE_CHK_RANGE(obj, "clr_r_buf_time", rt_set->upload.clr_r_buf_time, 8, 30, 0);

        PARSE_CHK_RANGE(obj, "hw_inf", rt_set->upload.hw_inf, 1, 7, 0);

        if (json_getobject(obj, "data_aggr", &tmpobj) == 0)
        {
            PARSE_CHK_RANGE(tmpobj, "mode", rt_set->upload.data_aggr.mode, 1, 1, 1);

            PARSE_CHK_RANGE(tmpobj, "timeval", rt_set->upload.data_aggr.timeval, 50, 86400000, 1);
        }

        if (rt_set->upload.hw_inf == Upload_Inf_Ethernet ||
                rt_set->upload.hw_inf == Upload_Inf_4G ||
                rt_set->upload.hw_inf == Upload_Inf_Wifi)
        {
            if (json_getobject(obj, "tcp", &tmpobj) == 0)
            {
                PARSE_CHK_STR(tmpobj, "ser_ip", rt_set->upload.sw_potl_params.tcp.ser_ip, 48, 1, 0);
                PARSE_CHK_RANGE(tmpobj, "ser_port", rt_set->upload.sw_potl_params.tcp.ser_port, 100, 65535, 1);
                rt_set->upload.sw_potl = Upload_Trans_Potl_Tcp;
            }
            else if (json_getobject(obj, "http", &tmpobj) == 0)
            {
                PARSE_CHK_STR(tmpobj, "url", rt_set->upload.sw_potl_params.http.url, (MaxUploadHttpUrlLen - 1), 1, 0);
                rt_set->upload.sw_potl = Upload_Trans_Potl_Http;
            }
            else if (json_getobject(obj, "mqtt", &tmpobj) == 0)
            {
                PARSE_CHK_STR(tmpobj, "host", rt_set->upload.sw_potl_params.mqtt.host, (Mqtt_MaxHostLen - 1), 1, 0);
                PARSE_CHK_RANGE(tmpobj, "port", rt_set->upload.sw_potl_params.mqtt.port, 100, 65535, 1);
                PARSE_CHK_STR(tmpobj, "user", rt_set->upload.sw_potl_params.mqtt.user, (Mqtt_MaxUserLen - 1), 1, 1);
                PARSE_CHK_STR(tmpobj, "pwd", rt_set->upload.sw_potl_params.mqtt.pwd, (Mqtt_MaxPwdLen - 1), 1, 1);
                PARSE_CHK_RANGE(tmpobj, "kal_time", rt_set->upload.sw_potl_params.mqtt.kal_time, 5, 86400, 1);
                PARSE_CHK_STR(tmpobj, "sub_b_topic", rt_set->upload.sw_potl_params.mqtt.sub_b_topic, (Mqtt_MaxSubBrdCTpLen - 1), 1, 1);
                PARSE_CHK_STR(tmpobj, "sub_u_topic", rt_set->upload.sw_potl_params.mqtt.sub_u_topic, (Mqtt_MaxSubUniCTpLen - 1), 1, 1);
                PARSE_CHK_STR(tmpobj, "pub_topic", rt_set->upload.sw_potl_params.mqtt.pub_topic, (Mqtt_MaxPubTpLen - 1), 1, 1);
                PARSE_CHK_RANGE(tmpobj, "sub_b_qos", rt_set->upload.sw_potl_params.mqtt.sub_b_qos, 0, 2, 1);
                PARSE_CHK_RANGE(tmpobj, "sub_u_qos", rt_set->upload.sw_potl_params.mqtt.sub_u_qos, 0, 2, 1);
                PARSE_CHK_RANGE(tmpobj, "pub_qos", rt_set->upload.sw_potl_params.mqtt.pub_qos, 0, 2, 1);
                PARSE_CHK_RANGE(tmpobj, "tls", rt_set->upload.sw_potl_params.mqtt.tls, 0, 1, 1);
                rt_set->upload.sw_potl = Upload_Trans_Potl_Mqtt;
            }
        }
        else if (rt_set->upload.hw_inf == Upload_Inf_Wiegand)
        {
            if (json_getobject(obj, "wiegand", &tmpobj) == 0)
            {
                PARSE_CHK_RANGE(tmpobj, "pls_width", rt_set->upload.sw_potl_params.wiegand.pls_width, 4, 20, 1);
                PARSE_CHK_RANGE(tmpobj, "pls_interval", rt_set->upload.sw_potl_params.wiegand.pls_interval, 8, 200, 1);
                PARSE_CHK_RANGE(tmpobj, "data_interval", rt_set->upload.sw_potl_params.wiegand.data_interval, 50, 1000, 1);
                PARSE_CHK_RANGE(tmpobj, "type", rt_set->upload.sw_potl_params.wiegand.type, 1, 3, 1);
                PARSE_CHK_RANGE(tmpobj, "bytes_order", rt_set->upload.sw_potl_params.wiegand.bytes_order, 0, 1, 0);
            }
            else
            {
                TRACE("wiegand not find\n");
                return -1;
            }
        }
    }

    if (json_getobject(jvalue, "gpi_trigger", &obj) == 0)
    {
        PARSE_CHK_RANGE(obj, "mode", rt_set->gpi_trigger.mode, 1, 5, 1);

        PARSE_CHK_RANGE(obj, "cond_order", rt_set->gpi_trigger.cond_order, 1, 2, 0);

        if (rt_set->gpi_trigger.mode == 2 || rt_set->gpi_trigger.mode == 3 ||
                rt_set->gpi_trigger.mode == 5)
        {
            PARSE_CHK_RANGE(obj, "timeval", rt_set->gpi_trigger.timeval, 500, 86400000, 1);
        }
        else if (rt_set->gpi_trigger.mode == 1 || rt_set->gpi_trigger.mode == 4)
        {
            PARSE_CHK_RANGE(obj, "timeval", rt_set->gpi_trigger.timeval, 5, 86400000, 1);
        }

        if (rt_set->gpi_trigger.mode == 5)
        {
            PARSE_CHK_RANGE(obj, "timeval2", rt_set->gpi_trigger.timeval2, 5, 86400000, 1);
        }

        if (json_getobject(obj, "cond_1", &tmpobj) == 0)
        {
            if (tmpobj->type == json_array)
            {
                int gpicnt = tmpobj->u.array.length;

                if (gpicnt == 0 || gpicnt > 4)
                {
                    TRACE("gpi_trigger.cond_1 length is invalid\n");
                    return -1;
                }

                for (i = 0; i < gpicnt; ++i)
                {
                    PARSE_CHK_RANGE(tmpobj->u.array.values[i], "id", rt_set->gpi_trigger.cond_1.ids[i], 1, 4, 1);

                    PARSE_CHK_RANGE(tmpobj->u.array.values[i], "state", rt_set->gpi_trigger.cond_1.states[i], 0, 1, 1);
                }

                rt_set->gpi_trigger.cond_1.count = gpicnt;
            }
            else
            {
                TRACE("gpi_trigger.cond_1 type error\n");
                return -1;
            }
        }
        else
        {
            TRACE("gpi_trigger.cond_1 dose not find\n");
            return -1;
        }

        if (rt_set->gpi_trigger.mode != 2)
        {
            if (json_getobject(obj, "cond_2", &tmpobj) == 0)
            {
                if (tmpobj->type == json_array)
                {
                    int gpicnt = tmpobj->u.array.length;

                    if (gpicnt == 0 || gpicnt > 4)
                    {
                        TRACE("gpi_trigger.cond_2 length is invalid\n");
                        return -1;
                    }

                    for (i = 0; i < gpicnt; ++i)
                    {
                        PARSE_CHK_RANGE(tmpobj->u.array.values[i], "id", rt_set->gpi_trigger.cond_2.ids[i], 1, 4, 1);

                        PARSE_CHK_RANGE(tmpobj->u.array.values[i], "state", rt_set->gpi_trigger.cond_2.states[i], 0, 1, 1);
                    }

                    rt_set->gpi_trigger.cond_2.count = gpicnt;
                }
                else
                {
                    TRACE("gpi_trigger.cond_2 type error\n");
                    return -1;
                }
            }
            else
            {
                TRACE("gpi_trigger.cond_2 dose not find\n");
                return -1;
            }
        }

        rt_set->gpi_trigger.is_gpi_trigger = 1;
    }


    PARSE_CHK_STR(jvalue, "cus_param", ((char *)rt_set->cus_param.param), 128, 0, 1);

    if (exflag)
    {
        int cuslen = strlen((char *)rt_set->cus_param.param);
//		printf("1111111111111111111111 cuslen:%d\n", cuslen);
        rt_set->cus_param.len = cuslen;
    }

    if (json_getobject(jvalue, "gpo_act", &obj) == 0)
    {
        if (obj->type == json_array)
        {
            int gacnt = obj->u.array.length;

            if (gacnt > 5)
            {
                TRACE("gpo_act length is invalid\n");
                return -1;
            }

            for (i = 0; i < gacnt; ++i)
            {
                PARSE_CHK_RANGE(obj->u.array.values[i], "id", rt_set->gpo_act.ids[i], 1, 5, 1);

                PARSE_CHK_RANGE(obj->u.array.values[i], "state", rt_set->gpo_act.states[i], 0, 1, 1);

