deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
                PARSE_CHK_RANGE(obj->u.array.values[i], "dur", rt_set->gpo_act.durs[i], 5, 86400000, 1);
            }

            rt_set->gpo_act.count = gacnt;
        }
        else
        {
            TRACE("gpo_act type error\n");
            return -1;
        }
    }

    if (json_getobject(jvalue, "tag_json_format", &obj) == 0)
    {
        if (obj->type == json_array)
        {
            int tjfcnt = obj->u.array.length;
            char tmpselbuf[8];
            int tjfid;

            if (tjfcnt > 9)
            {
                TRACE("tag_json_format obj length is invalid\n");
                return -1;
            }

            rt_set->tag_json_format = 0;

            for (i = 0; i < tjfcnt; ++i)
            {
                sprintf(tmpselbuf, "[%d]", i);

                if (json_getint(obj, tmpselbuf, &tjfid) != 0)
                {
                    TRACE("tag_json_format item is invalid\n");
                    return -1;
                }

                rt_set->tag_json_format |= 1 << tjfid;
            }
        }
        else
        {
            TRACE("tag_json_format obj type is invalid\n");
            return -1;
        }
    }

    if (json_getobject(jvalue, "events", &obj) == 0)
    {
        if (obj->type == json_array)
        {
            int ecnt = obj->u.array.length;
            char tmpselbuf[8];
            int eid;

            if (ecnt > 10)
            {
                TRACE("events obj length is invalid\n");
                return -1;
            }

            for (i = 0; i < ecnt; ++i)
            {
                sprintf(tmpselbuf, "[%d]", i);

                if (json_getint(obj, tmpselbuf, &eid) != 0)
                {
                    TRACE("events item is invalid\n");
                    return -1;
                }

                rt_set->events.ids[i] = eid;
            }

            rt_set->events.count = ecnt;
        }
        else
        {
            TRACE("events obj type is invalid\n");
            return -1;
        }
    }

    return 0;
}

int valid_runtime_settings(char *buf, int blen, ReaderRunTimeSettings_ST *rt_set)
{
    json_value *jvalue;

    jvalue = json_parse_auto(buf, blen);

    if (jvalue == NULL)
    {
        TRACE("valid_runtime_settings jvalue == NULL\n");
        return -1;
    }

    return valid_runtime_settings_byobj(jvalue, rt_set);
}

int check_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
    if (rt_set->upload.hw_inf == 0)
        return -1;
    else
    {
        if (Upload_Inf_Ethernet == rt_set->upload.hw_inf)
        {
            if (get_spi_ex_dev() != Spi_Ex_Ethernet)
                return -1;
        }
        else if (Upload_Inf_4G == rt_set->upload.hw_inf)
        {
            if (get_uart_ex_dev() != Uart_Ex_4G)
                return -1;
        }
        else if (Upload_Inf_Wifi == rt_set->upload.hw_inf)
        {
            if (get_uart_ex_dev() != Uart_Ex_Wlan)
                return -1;
        }

        if (rt_set->upload.hw_inf == Upload_Inf_Ethernet ||
                rt_set->upload.hw_inf == Upload_Inf_4G ||
                rt_set->upload.hw_inf == Upload_Inf_Wifi)
        {
            if (rt_set->upload.sw_potl == Upload_Trans_Potl_None)
                return -1;
        }
    }

    return 0;
}

int cmd_config_runtime_settings(json_value *jvalue,
                                char *cfg_name, char *buf, int blen)
{
    ReaderRunTimeSettings_ST *rrtsettings;
    int validret;

    rrtsettings = malloc_hexp(sizeof(ReaderRunTimeSettings_ST));

    if (jvalue == NULL)
        validret = valid_runtime_settings(buf, blen, rrtsettings);
    else
        validret = valid_runtime_settings_byobj(jvalue, rrtsettings);

    if (validret == 0)
    {
        setdef_rdr_runtime_settings(rrtsettings);

        if (rrtsettings->reset == 0)
            get_rdr_runtime_settings(rrtsettings);

        if (jvalue == NULL)
            validret = valid_runtime_settings(buf, blen, rrtsettings);
        else
        {
            json_value *obj1;
            json_value *obj2;
            obj1 = json_parse_auto(buf, blen);

            if (obj1 != NULL)
            {
                if (json_getobject(obj1, cfg_name, &obj2) == 0)
                    validret = valid_runtime_settings_byobj(obj2, rrtsettings);
                else
                {
                    TRACE("valid_runtime_settings_byobj(obj2, rrtsettings) failed\n");
                    validret = -1;
                }
            }
            else
            {
                TRACE("cmd_config_static_settings obj1 == NULL\n");
                validret = -1;
            }
        }

        if (validret == 0)
        {
            dump_runtime_settings(rrtsettings);
            validret = check_runtime_settings(rrtsettings);

            if (validret == 0)
            {
                set_rdr_runtime_settings(rrtsettings);
                sleep_ms(200);
                set_workmode_params(WorkMode_ActVer_2);
            }
        }
    }

    free_hexp(rrtsettings);
    return validret;
}

void Data2BinStr(unsigned char *buf, int bitlen, char *str)
{
    *str = 0;
    int tmp;
    char tmpbuf[10];
    int i;

    for (i = 0; i < bitlen / 8; ++i)
    {
        for (int j = 0; j < 8; ++j)
        {
            tmp = (buf[i] >> (7 - j)) & 0x1;
            sprintf(tmpbuf, "%d", tmp);
            strcat(str, tmpbuf);
        }
    }

    for (int c = 0; c < bitlen % 8; ++c)
    {
        tmp = (buf[i] >> (7 - c)) & 0x1;
        sprintf(tmpbuf, "%d", tmp);
        strcat(str, tmpbuf);
    }
}

void setdef_rdr_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
//	int i;

    rt_set->tag_json_format = 0x0007;
    rt_set->glob_params.hb_cylce = 10;
    rt_set->glob_params.s_buf_size = 1580;

    if (get_spi_ex_dev() == Spi_Ex_Ethernet)
        sprintf(rt_set->glob_params.name, "%02X%02X%02X%02X%02X%02X",
                gNetConf.mac[0], gNetConf.mac[1], gNetConf.mac[2], gNetConf.mac[3],
                gNetConf.mac[4], gNetConf.mac[5]);
    else
        rt_set->glob_params.name[0] = 0;

