deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
//	rt_set->bankdata.is_bankdata = 0;

    rt_set->cus_param.param[0] = 0;
    rt_set->cus_param.len = 0;

    rt_set->events.count = 2;

    rt_set->events.ids[0] = rdr_rt_evt_TagRead;
    rt_set->events.ids[1] = rdr_rt_evt_HeartBeat;

    memset(&rt_set->gpi_trigger, 0, sizeof(rdr_rt_set_gpi_trigger));

    rt_set->gpi_trigger.cond_order = 1;

    rt_set->gpo_act.count = 0;
    /*
    for (i = 0; i < 16; ++i)
    	rt_set->inventory.ants[i] = 0;
    rt_set->inventory.interval = 10;
    rt_set->inventory.cycle = 150;
    rt_set->inventory.inv_mode = 0;

    rt_set->tagfilter.is_tagfilter = 0;
    */
    rt_set->upload.hw_inf = 0;
    rt_set->upload.sw_potl = 0;
    rt_set->upload.data_aggr.mode = 1;
    rt_set->upload.data_aggr.timeval = 2000;
    rt_set->upload.client_ack = 0;
    rt_set->upload.crc_enable = 1;
    rt_set->upload.recv_timeout = 10;
    rt_set->upload.clr_r_buf_time = 8;
//	memset(rt_set->bankdata.pwd, 0, 4);
}

void tojson_rdr_runtime_settings(ReaderRunTimeSettings_ST *rt_set, char *jstart, int *len)
{
    int i;
//	int isants = 0;

    sprintf(jstart, "{\"glob_params\":{\"hb_cylce\":%d,\"s_buf_size\":%d,\"name\":\"%s\"},",
            rt_set->glob_params.hb_cylce, rt_set->glob_params.s_buf_size, rt_set->glob_params.name);

    sprintf(jstart + strlen(jstart), "\"upload\":{\"client_ack\":%d,\"crc_enable\":%d,\"recv_timeout\":%d,\"clr_r_buf_time\":%d,\"hw_inf\":%d,",
            rt_set->upload.client_ack, rt_set->upload.crc_enable, rt_set->upload.recv_timeout, rt_set->upload.clr_r_buf_time, rt_set->upload.hw_inf);

    if (rt_set->upload.hw_inf == Upload_Inf_Ethernet ||
            rt_set->upload.hw_inf == Upload_Inf_4G ||
            rt_set->upload.hw_inf == Upload_Inf_Wifi)
    {
        if (rt_set->upload.sw_potl == Upload_Trans_Potl_Tcp)
            sprintf(jstart + strlen(jstart), "\"tcp\":{\"ser_ip\":\"%s\",\"ser_port\":%d},",
                    rt_set->upload.sw_potl_params.tcp.ser_ip, rt_set->upload.sw_potl_params.tcp.ser_port);
        else if (rt_set->upload.sw_potl == Upload_Trans_Potl_Http)
            sprintf(jstart + strlen(jstart), "\"http\":{\"url\":\"%s\"},", rt_set->upload.sw_potl_params.http.url);
        else if (rt_set->upload.sw_potl == Upload_Trans_Potl_Mqtt)
        {
            sprintf(jstart + strlen(jstart), "\"mqtt\":{\"host\":\"%s\",\"port\":%d,\"kal_time\":%d,\"pub_topic\":\"%s\",\"pub_qos\":%d,",
                    rt_set->upload.sw_potl_params.mqtt.host, rt_set->upload.sw_potl_params.mqtt.port,
                    rt_set->upload.sw_potl_params.mqtt.kal_time, rt_set->upload.sw_potl_params.mqtt.pub_topic,
                    rt_set->upload.sw_potl_params.mqtt.pub_qos);
            sprintf(jstart + strlen(jstart), "\"user\":\"%s\",", rt_set->upload.sw_potl_params.mqtt.user);
            sprintf(jstart + strlen(jstart), "\"pwd\":\"%s\",", rt_set->upload.sw_potl_params.mqtt.pwd);
            sprintf(jstart + strlen(jstart), "\"sub_b_topic\":\"%s\",", rt_set->upload.sw_potl_params.mqtt.sub_b_topic);
            sprintf(jstart + strlen(jstart), "\"sub_b_qos\":%d,", rt_set->upload.sw_potl_params.mqtt.sub_b_qos);
            sprintf(jstart + strlen(jstart), "\"sub_u_topic\":\"%s\",", rt_set->upload.sw_potl_params.mqtt.sub_u_topic);
            sprintf(jstart + strlen(jstart), "\"sub_u_qos\":%d,", rt_set->upload.sw_potl_params.mqtt.sub_u_qos);
            sprintf(jstart + strlen(jstart), "\"tls\":%d},", rt_set->upload.sw_potl_params.mqtt.tls);
        }
    }
    else if (rt_set->upload.hw_inf == Upload_Inf_Wiegand)
        sprintf(jstart + strlen(jstart), "\"wiegand\":{\"type\":%d,\"pls_width\":%d,\"pls_interval\":%d,\"data_interval\":%d,\"bytes_order\":%d},",
                rt_set->upload.sw_potl_params.wiegand.type, rt_set->upload.sw_potl_params.wiegand.pls_width,
                rt_set->upload.sw_potl_params.wiegand.pls_interval, rt_set->upload.sw_potl_params.wiegand.data_interval,
                rt_set->upload.sw_potl_params.wiegand.bytes_order);

    sprintf(jstart + strlen(jstart), "\"data_aggr\":{\"mode\":%d,\"timeval\":%d}",
            rt_set->upload.data_aggr.mode, rt_set->upload.data_aggr.timeval);
    sprintf(jstart + strlen(jstart), "},");

    if (rt_set->gpi_trigger.is_gpi_trigger == 1)
    {
        if (rt_set->gpi_trigger.mode != 5)
            sprintf(jstart + strlen(jstart), "\"gpi_trigger\":{\"mode\":%d,\"cond_order\":%d,\"timeval\":%d,\"cond_1\":[",
                    rt_set->gpi_trigger.mode, rt_set->gpi_trigger.cond_order, rt_set->gpi_trigger.timeval);
        else
            sprintf(jstart + strlen(jstart), "\"gpi_trigger\":{\"mode\":%d,\"cond_order\":%d,\"timeval\":%d,\"timeval2\":%d,\"cond_1\":[",
                    rt_set->gpi_trigger.mode, rt_set->gpi_trigger.cond_order, rt_set->gpi_trigger.timeval, rt_set->gpi_trigger.timeval2);

        for (i = 0; i < rt_set->gpi_trigger.cond_1.count; ++i)
        {
            sprintf(jstart + strlen(jstart), "{\"id\":%d,\"state\":%d},", rt_set->gpi_trigger.cond_1.ids[i],
                    rt_set->gpi_trigger.cond_1.states[i]);
        }

        sprintf(jstart + strlen(jstart) -1, "],");

        if (rt_set->gpi_trigger.mode != 2)
        {
            sprintf(jstart + strlen(jstart), "\"cond_2\":[");

            for (i = 0; i < rt_set->gpi_trigger.cond_2.count; ++i)
                sprintf(jstart + strlen(jstart), "{\"id\":%d,\"state\":%d},", rt_set->gpi_trigger.cond_2.ids[i],
                        rt_set->gpi_trigger.cond_2.states[i]);

            sprintf(jstart + strlen(jstart) -1, "]");
        }

        sprintf(jstart + strlen(jstart), "},");
    }

    if (rt_set->gpo_act.count > 0)
    {
        sprintf(jstart + strlen(jstart), "\"gpo_act\":[");

        for (i = 0; i < rt_set->gpo_act.count; ++i)
        {
            sprintf(jstart + strlen(jstart), "{\"id\":%d,\"state\":%d,\"dur\":%d},", rt_set->gpo_act.ids[i],
                    rt_set->gpo_act.states[i], rt_set->gpo_act.durs[i]);
        }

        sprintf(jstart + strlen(jstart) -1, "],");
    }

    if (rt_set->events.count > 0)
    {
        sprintf(jstart + strlen(jstart), "\"events\":[");

        for (i = 0; i < rt_set->events.count; ++i)
            sprintf(jstart + strlen(jstart), "%d,", rt_set->events.ids[i]);

        sprintf(jstart + strlen(jstart) -1, "],");
    }


    if (rt_set->tag_json_format > 0)
    {
        sprintf(jstart + strlen(jstart), "\"tag_json_format\":[");

        for (i = 0; i < 16; ++i)
        {
            if (((rt_set->tag_json_format >> i) & 0x01) == 0x01)
                sprintf(jstart + strlen(jstart), "%d,", i);
        }

        sprintf(jstart + strlen(jstart) -1, "],");
    }
    else
        sprintf(jstart + strlen(jstart), "\"tag_json_format\":[],");

    if (rt_set->cus_param.len > 0)
        sprintf(jstart + strlen(jstart), "\"cus_param\":\"%s\",", (char *)rt_set->cus_param.param);

    sprintf(jstart + strlen(jstart) -1, "}");

    *len = strlen(jstart);
//	TRACE("len:%d, tojson_rdr_runtime_settings:%s\n", *len, jstart);
}

