deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
    if (json_getobject(jvalue, "uart2", &obj) == 0)
    {
        PARSE_CHK_IN_TAB(obj, "baud", static_set->uart2.baud, baud_tab, 0);

        PARSE_CHK_RANGE(obj, "address", static_set->uart2.address, 1, 254, 0);

        PARSE_CHK_IN_TAB(obj, "type", static_set->uart2.type, uarttype_tab, 0);

        PARSE_CHK_IN_TAB(obj, "stop_bits", static_set->uart2.stop_bits, stopbit_tab, 0);

        PARSE_CHK_IN_TAB(obj, "data_bits", static_set->uart2.data_bits, databit_tab, 0);

        PARSE_CHK_IN_TAB(obj, "parity", static_set->uart2.parity, parity_tab, 0);

        PARSE_CHK_IN_TAB(obj, "flow_ctrl", static_set->uart2.flow_ctrl, flow_ctrl_tab, 0);
    }

    static_set->is_ethernet = 0;

    if (json_getobject(jvalue, "ethernet", &obj) == 0)
    {
        if (get_spi_ex_dev() == Spi_Ex_Ethernet)
        {
            memcpy(&static_set->ethernet, &gNetConf, sizeof(gNetConf));

            if (valid_ipinfo_cfg(obj, &static_set->ethernet) != 0)
            {
                TRACE("ethernet is invalid\n");
                return -1;
            }

            static_set->is_ethernet = 1;
        }
        else
        {
            TRACE("no ethernet interface\n");
            return -1;
        }
    }

    static_set->uart_ex_type = Uart_Ex_None;

    if (json_getobject(jvalue, "wlan", &obj) == 0)
    {
        if (get_uart_ex_dev() == Uart_Ex_Wlan)
        {
            setdef_wlan_config(&static_set->uart_ex.wlan);

            if (valid_wlan_config_byobj(obj, &static_set->uart_ex.wlan) != 0)
            {
                TRACE("wlan is invalid\n");
                return -1;
            }

            static_set->uart_ex_type = Uart_Ex_Wlan;
        }
        else
        {
            TRACE("no wlan interface\n");
            return -1;
        }
    }

    if (json_getobject(jvalue, "bluetooth", &obj) == 0)
    {
        if (get_uart_ex_dev() == Uart_Ex_Bluetooth)
        {
            setdef_bluetooth_config(&static_set->uart_ex.ble);

            if (valid_bluetooth_config_byobj(obj, &static_set->uart_ex.ble) != 0)
            {
                TRACE("bluetooth is invalid\n");
                return -1;
            }

            static_set->uart_ex_type = Uart_Ex_Bluetooth;
        }
        else
        {
            TRACE("no bluetooth interface\n");
            return -1;
        }
    }

    if (json_getobject(jvalue, "monet", &obj) == 0)
    {
        if (get_uart_ex_dev() == Uart_Ex_4G)
        {
            setdef_monet_config(&static_set->uart_ex.monet);

            if (valid_monet_config_byobj(obj, &static_set->uart_ex.monet) != 0)
            {
                TRACE("monet is invalid\n");
                return -1;
            }

            static_set->uart_ex_type = Uart_Ex_4G;
        }
        else
        {
            TRACE("no monet interface\n");
            return -1;
        }
    }

    return 0;
}

int valid_static_settings(char *buf, int blen, ReaderStaticSettings_ST *static_set)
{
    json_value *jvalue;

    jvalue = json_parse_auto(buf, blen);

    if (jvalue == NULL)
    {
        TRACE("valid_static_settings jvalue == NULL\n");
        return -1;
    }

    return valid_static_settings_byobj(jvalue, static_set);
}

int cmd_config_static_settings(json_value *jvalue, char *cfg_name,
                               char *buf, int blen, int *reboot)
{
    ReaderStaticSettings_ST *rssettings;
    int validret;

    rssettings = malloc_hexp(sizeof(ReaderStaticSettings_ST));

    if (jvalue == NULL)
        validret = valid_static_settings(buf, blen, rssettings);
    else
        validret = valid_static_settings_byobj(jvalue, rssettings);

    if (validret == 0)
    {
        setdef_rdr_static_settings(rssettings);

        if (rssettings->reset == 0)
            get_rdr_static_settings(rssettings);

        if (jvalue == NULL)
            validret = valid_static_settings(buf, blen, rssettings);
        else
        {
            json_value *obj1;
            json_value *obj2;
            obj1 = json_parse_auto(buf, blen);

            if (obj1 != NULL)
            {
                if (json_getobject(obj1, cfg_name, &obj2) == 0)
                    validret = valid_static_settings_byobj(obj2, rssettings);
                else
                {
                    TRACE("valid_static_settings_byobj(obj2, rssettings) failed\n");
                    validret = -1;
                }
            }
            else
            {
                TRACE("cmd_config_static_settings obj1 == NULL\n");
                validret = -1;
            }
        }

        if (validret == 0)
        {
            dump_static_settings(rssettings);

            if (rssettings->is_ethernet == 1)
            {
                TRACE("if (rssettings->is_ethernet == 1)\n");
                /* v9.81t: �d sleep_ms(150)  osDelay 硁死(RTX tick 停)，打死保存流程 */
                set_network_config(&rssettings->ethernet);
            }

            if (rssettings->uart_ex_type == Uart_Ex_Wlan)
            {
                TRACE("if (rssettings->uart_ex_type == Uart_Ex_Wlan)\n");
                set_wlan_config(&rssettings->uart_ex.wlan);
                sleep_ms(150);
            }

            if (rssettings->uart_ex_type == Uart_Ex_Bluetooth)
            {
                TRACE("if (rssettings->uart_ex_type == Uart_Ex_Bluetooth)\n");
                set_bluetooth_config(&rssettings->uart_ex.ble);
                sleep_ms(150);
            }

            if (rssettings->uart_ex_type == Uart_Ex_4G)
            {
                TRACE("if (rssettings->uart_ex_type == Uart_Ex_4G)\n");
                set_monet_config(&rssettings->uart_ex.monet);
                sleep_ms(150);
            }

            set_rdr_static_settings(rssettings);
            *reboot = rssettings->reboot;
        }
    }

    free_hexp(rssettings);
    return validret;
}

/*
int valid_modbus_uart(char *buf, int blen, rdr_st_set_modbus_uart *moduart)
{
	int baud_tab[] = {9600, 19200, 38400, 57600, 115200, 230400, 460800, 921600};
	int databit_tab[] = {0, 1};
	int stopbit_tab[] = {0, 1};
	int parity_tab[] = {0, 1, 2};
	int flow_ctrl_tab[] = {0, 1};
	int uarttype_tab[] = {0, 1};
//	int reset = 1;
	int pvalint;

	json_value *obj;

	moduart->is_modbus_uart = 0;

