deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
	obj = json_parse_auto(buf, blen);
	if (obj == NULL)
	{
		TRACE("valid_modbus_uart jvalue == NULL\n");
		return -1;
	}

	PARSE_CHK_IN_TAB(obj, "baud", moduart->baud,  baud_tab, 1);

	PARSE_CHK_RANGE(obj, "address", moduart->address, 2, 255, 1);

	PARSE_CHK_IN_TAB(obj, "type", moduart->type, uarttype_tab, 1);

	PARSE_CHK_IN_TAB(obj, "stop_bits", moduart->stop_bits, stopbit_tab, 1);

	PARSE_CHK_IN_TAB(obj, "data_bits", moduart->data_bits, databit_tab, 1);

	PARSE_CHK_IN_TAB(obj, "parity", moduart->parity, parity_tab, 1);

	PARSE_CHK_IN_TAB(obj, "flow_ctrl", moduart->flow_ctrl, flow_ctrl_tab, 1);

	moduart->is_modbus_uart = 1;
	return 0;
}
*/
extern uint8 gMonetState;
void tojson_rdr_static_settings(ReaderStaticSettings_ST *static_set,
                                char *jstart, int *len, int isexcfg)
{
    int i;
    int isgpo = 0;

    sprintf(jstart, "{\"app_init\":{\"usb_type\":%d,\"max_tb_rec_len\":%d,\"evt_que_len\":%d},",
            static_set->app_init.usb_type, static_set->app_init.max_tb_rec_len, static_set->app_init.evt_que_len);

    sprintf(jstart + strlen(jstart), "\"tagops_param\":{\"inventory\":{\"cycle\":%d,\"interval\":%d,\"inv_mode\":%d,",
            static_set->tagops_param.inventory.cycle, static_set->tagops_param.inventory.interval,
            static_set->tagops_param.inventory.inv_mode);

    if (static_set->tagops_param.inventory.ants_cnt > 0)
    {
        sprintf(jstart + strlen(jstart), "\"ants\":[");

        for (i = 0; i < static_set->tagops_param.inventory.ants_cnt; ++i)
            sprintf(jstart + strlen(jstart), "%d,", static_set->tagops_param.inventory.ants[i]);

        sprintf(jstart + strlen(jstart) -1, "],");
    }

    sprintf(jstart + strlen(jstart) -1, "},");

    if (static_set->tagops_param.tagfilter.is_tagfilter == 1)
    {
        char *binstr;

        sprintf(jstart + strlen(jstart), "\"tagfilter\":{\"bank\":%d,\"start\":%d,\"match\":%d,\"mask\":\"",
                static_set->tagops_param.tagfilter.bank, static_set->tagops_param.tagfilter.start,
                static_set->tagops_param.tagfilter.match);

        binstr = malloc_hexp(513);
        Data2BinStr(static_set->tagops_param.tagfilter.mask,
                    static_set->tagops_param.tagfilter.mask_len, binstr);
        sprintf(jstart + strlen(jstart), "%s\"},", binstr);
        free_hexp(binstr);
    }

    if (static_set->tagops_param.bankdata.is_bankdata == 1)
        sprintf(jstart + strlen(jstart), "\"bankdata\":{\"bank\":%d,\"start\":%d,\"blkcnt\":%d},",
                static_set->tagops_param.bankdata.bank, static_set->tagops_param.bankdata.start,
                static_set->tagops_param.bankdata.blkcnt);

    sprintf(jstart + strlen(jstart), "\"accessop\":{\"ant\":%d,\"timeout\":%d,",
            static_set->tagops_param.accessop.ant, static_set->tagops_param.accessop.timeout);

    if (GetNumU32(static_set->tagops_param.accessop.aespwd) != 0)
        sprintf(jstart + strlen(jstart), "\"aespwd\":\"%08X\"},",
                GetNumU32(static_set->tagops_param.accessop.aespwd));
    else
        sprintf(jstart + strlen(jstart) -1, "},");

    if (static_set->tagops_param.mb_sinv_tag_fmt > 0)
    {
        sprintf(jstart + strlen(jstart), "\"mb_sinv_tag_fmt\":[");

        for (i = 0; i < 16; ++i)
        {
            if (((static_set->tagops_param.mb_sinv_tag_fmt >> i) & 0x01) == 0x01)
                sprintf(jstart + strlen(jstart), "%d,", i);
        }

        sprintf(jstart + strlen(jstart) -1, "],");
    }
    else
        sprintf(jstart + strlen(jstart), "\"mb_sinv_tag_fmt\":[],");

    sprintf(jstart + strlen(jstart) -1, "},");

    sprintf(jstart + strlen(jstart), "\"protocol\":{\"gen2\":{\"session\":%d,\"q\":%d,\"target\":%d,\"profile\":%d}},",
            static_set->protocol.gen2.session, static_set->protocol.gen2.q, static_set->protocol.gen2.target,
            static_set->protocol.gen2.profile);

    sprintf(jstart + strlen(jstart), "\"rf\":{\"ant_max_dwell_time\":%d,\"hop_mode\":%d,\"region\":%d,",
            static_set->rf.ant_max_dwell_time, static_set->rf.hop_mode, static_set->rf.region);

    if (static_set->rf.hop_table_cnt != 0)
    {
        sprintf(jstart + strlen(jstart), "\"hop_table\":[");

        for (i = 0; i < static_set->rf.hop_table_cnt; ++i)
            sprintf(jstart + strlen(jstart), "%d,", static_set->rf.hop_table[i]);

        sprintf(jstart + strlen(jstart) -1, "],");
    }


    sprintf(jstart + strlen(jstart), "\"tx_powers\":[");

    if (gAntNumber == -1)
        sprintf(jstart + strlen(jstart), "],");
    else
    {
        for (i = 0; i < gAntNumber; ++i)
            sprintf(jstart + strlen(jstart), "{\"id\":%d,\"rp\":%d,\"wp\":%d},", i + 1, static_set->rf.tx_powers[i].read_power,
                    static_set->rf.tx_powers[i].write_power);

        sprintf(jstart + strlen(jstart) -1, "],");
    }

    sprintf(jstart + strlen(jstart) -1, "},");


    sprintf(jstart + strlen(jstart), "\"tag_data\":{\"unique_by_antenna\":%d,\"unique_by_bank_data\":%d,\"record_highest_rssi\":%d},",
            static_set->tag_data.unique_by_antenna, static_set->tag_data.unique_by_bank_data,
            static_set->tag_data.record_highest_rssi);

    for (i = 0; i < 4; ++i)
    {
        if (static_set->gpos[i] != 0)
        {
            isgpo = 1;
            break;
        }
    }

    if (isgpo == 1)
    {
        sprintf(jstart + strlen(jstart), "\"gpos\":[");

        for (i = 0; i < 4; ++i)
        {
            if (static_set->gpos[i] != 0)
                sprintf(jstart + strlen(jstart), "{\"id\":%d,\"state\":%d},", i + 1,
                        static_set->gpos[i] - 1);
        }

        sprintf(jstart + strlen(jstart) -1, "],");
    }

    sprintf(jstart + strlen(jstart), "\"uart1\":{");
    sprintf(jstart + strlen(jstart), "\"type\":%d,", static_set->uart1.type);
    sprintf(jstart + strlen(jstart), "\"address\":%d,", static_set->uart1.address);
    sprintf(jstart + strlen(jstart), "\"baud\":%d,", static_set->uart1.baud);
    sprintf(jstart + strlen(jstart), "\"data_bits\":%d,", static_set->uart1.data_bits);
    sprintf(jstart + strlen(jstart), "\"stop_bits\":%d,", static_set->uart1.stop_bits);
    sprintf(jstart + strlen(jstart), "\"flow_ctrl\":%d,", static_set->uart1.flow_ctrl);
    sprintf(jstart + strlen(jstart), "\"parity\":%d},", static_set->uart1.parity);

    sprintf(jstart + strlen(jstart), "\"uart2\":{");
    sprintf(jstart + strlen(jstart), "\"type\":%d,", static_set->uart2.type);
    sprintf(jstart + strlen(jstart), "\"address\":%d,", static_set->uart2.address);
    sprintf(jstart + strlen(jstart), "\"baud\":%d,", static_set->uart2.baud);
    sprintf(jstart + strlen(jstart), "\"data_bits\":%d,", static_set->uart2.data_bits);
    sprintf(jstart + strlen(jstart), "\"stop_bits\":%d,", static_set->uart2.stop_bits);
    sprintf(jstart + strlen(jstart), "\"flow_ctrl\":%d,", static_set->uart2.flow_ctrl);
    sprintf(jstart + strlen(jstart), "\"parity\":%d},", static_set->uart2.parity);

    if (get_spi_ex_dev() == Spi_Ex_Ethernet  && isexcfg == 1)
    {
        sprintf(jstart + strlen(jstart), "\"ethernet\":{");
        sprintf(jstart + strlen(jstart), "\"ip\":\"%d.%d.%d.%d\",", gNetConf.ip[0],
                gNetConf.ip[1], gNetConf.ip[2], gNetConf.ip[3]);
        sprintf(jstart + strlen(jstart), "\"nm\":\"%d.%d.%d.%d\",", gNetConf.subnetMask[0],
                gNetConf.subnetMask[1], gNetConf.subnetMask[2], gNetConf.subnetMask[3]);
        sprintf(jstart + strlen(jstart), "\"gw\":\"%d.%d.%d.%d\",", gNetConf.gatewayIP[0],
                gNetConf.gatewayIP[1], gNetConf.gatewayIP[2], gNetConf.gatewayIP[3]);
        sprintf(jstart + strlen(jstart), "\"dns\":\"%d.%d.%d.%d\",", gNetConf.dnsServer[0],
                gNetConf.dnsServer[1], gNetConf.dnsServer[2], gNetConf.dnsServer[3]);
        sprintf(jstart + strlen(jstart), "\"mac\":\"%02X%02X%02X%02X%02X%02X\",", gNetConf.mac[0],
                gNetConf.mac[1], gNetConf.mac[2], gNetConf.mac[3], gNetConf.mac[4], gNetConf.mac[5]);
        sprintf(jstart + strlen(jstart), "\"lport\":%d},", gNetConf.listenPort);
    }

    if (get_uart_ex_dev() == Uart_Ex_Wlan && isexcfg == 1)
    {
        WlanConfig_ST *wlanconf = malloc_hexp(sizeof(WlanConfig_ST));
        int wclen;
        get_wlan_config(wlanconf);
        sprintf(jstart + strlen(jstart), "\"wlan\":");
        tojson_wlan_config(wlanconf, jstart + strlen(jstart), &wclen);
        sprintf(jstart + strlen(jstart), ",");
        free_hexp(wlanconf);
    }

    if (get_uart_ex_dev() == Uart_Ex_Bluetooth && isexcfg == 1)
    {
        BluetoothConfig_ST *blest = malloc_hexp(sizeof(BluetoothConfig_ST));
        int btlen;
        get_bluetooth_config(blest);

        sprintf(jstart + strlen(jstart), "\"bluetooth\":");
        tojson_bluetooth_config(blest, jstart + strlen(jstart), &btlen);
        sprintf(jstart + strlen(jstart), ",");
        free_hexp(blest);
    }

