deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
    if (get_uart_ex_dev() == Uart_Ex_4G && isexcfg == 1)
    {
        MonetConfig_ST *monst = malloc_hexp(sizeof(MonetConfig_ST));
        int molen;
        get_monet_config(monst);

        sprintf(jstart + strlen(jstart), "\"monet\":");
        tojson_monet_config(monst, jstart + strlen(jstart), &molen);
        sprintf(jstart + strlen(jstart), ",");
        free_hexp(monst);
    }

    sprintf(jstart + strlen(jstart) -1, "}");

    *len = strlen(jstart);
//	TRACE("tojson_rdr_static_settings:%s\n", jstart);
}

int set_rdr_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
    int err = 0;
    ConfReadBuffer confBuf;
    int pos = strlen(ActModeCfg_Marker);
    char *jstart;
    int jlen;
    E(pre_set_config(&confBuf));
    memcpy(confBuf.activemodecfgbuf, ActModeCfg_Marker, pos);
//	SetNumU16(confBuf.passivemodecfgbuf+pos, len);
    jstart = (char *)confBuf.activemodecfgbuf + pos + 2;

    tojson_rdr_runtime_settings(rt_set, jstart, &jlen);
    deviceID_update(rt_set); //20250315
    set_eastag_to_flash();  //20250315
    SetNumU16(confBuf.activemodecfgbuf + pos, jlen);
    E(set_config_to_flash(&confBuf));
FIN:
    return err;
}

int set_rdr_static_settings(ReaderStaticSettings_ST *static_set)
{
    int err = 0;
    ConfReadBuffer confBuf;
    int pos = strlen(RdrStaticSets_Marker);
    char *jstart;
    int jlen;
    E(pre_set_config(&confBuf));
    memcpy(confBuf.passivemodecfgbuf, RdrStaticSets_Marker, pos);
//	SetNumU16(confBuf.passivemodecfgbuf+pos, len);
    jstart = (char *)confBuf.passivemodecfgbuf + pos + 2;

    tojson_rdr_static_settings(static_set, jstart, &jlen, 0);

    SetNumU16(confBuf.passivemodecfgbuf + pos, jlen);
    E(set_config_to_flash(&confBuf));
FIN:
    return err;
}

int get_rdr_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
    int pos = strlen(ActModeCfg_Marker);
    char *rtbuf = malloc_hexp(MaxActiveModeConfigLen);

    if (rtbuf == NULL)
    {
        TRACE("get_rdr_runtime_settings:no enough memory\n");
        return -1;
    }

    setdef_rdr_runtime_settings(rt_set);
    flash_bytes_read(ActiveModeConfig_Addr, rtbuf, MaxActiveModeConfigLen);

    if (memcmp(ActModeCfg_Marker, rtbuf, pos) == 0)
    {
        int jsonlen = GetNumU16((uint8 *)rtbuf + pos);
        int vlret;
        pos += 2;
        vlret = valid_runtime_settings(rtbuf + pos, jsonlen, rt_set);
        TRACE("get_rdr_runtime_settings valid_runtime_settings vlret:%d\n", vlret);

        if (vlret != 0)
        {
            setdef_rdr_runtime_settings(rt_set);
        }
        else
        {
           deviceID_update(rt_set); //20250315
        }

        free_hexp(rtbuf);

        return vlret;
    }
    else
    {
        setdef_rdr_runtime_settings(rt_set);
        TRACE("not find ActModeCfg_Marker\n");
        free_hexp(rtbuf);
        return -1;
    }
}

int get_rdr_static_settings(ReaderStaticSettings_ST *static_set)
{
    int pos = strlen(RdrStaticSets_Marker);
    char *passbuf = malloc_hexp(MaxPassiveModeConfigLen);

    if (passbuf == NULL)
    {
        TRACE("get_rdr_static_settings:no enough memory\n");
        return -1;
    }

    setdef_rdr_static_settings(static_set);

    flash_bytes_read(PassiveModeConfig_Addr, passbuf, MaxPassiveModeConfigLen);

    if (memcmp(RdrStaticSets_Marker, passbuf, pos) == 0)
    {
        int jsonlen = GetNumU16((uint8 *)passbuf + pos);
        int vlret;
        pos += 2;
        vlret = valid_static_settings(passbuf + pos, jsonlen, static_set);

        if (vlret != 0)
            setdef_rdr_static_settings(static_set);

        TRACE("get_rdr_static_settings valid_static_settings vlret:%d\n", vlret);
        free_hexp(passbuf);
        return vlret;
    }
    else
    {
        setdef_rdr_static_settings(static_set);
        TRACE("not find RdrStaticSets_Marker\n");
        free_hexp(passbuf);
        return -1;
    }
}

int get_workmode_params(WorkMode_Code *wmode)
{
    uint8 header[32];
    int pos = strlen(WorkModeParams_Marker);

    flash_bytes_read(WorkModeParams_Addr, header, 32);

    if (memcmp(header, WorkModeParams_Marker, strlen(WorkModeParams_Marker)) != 0)
        *wmode = WorkMode_Passive;
    else
        *wmode = (WorkMode_Code)GetNumU32(header + pos);

    return 0;
}

int set_workmode_params(WorkMode_Code wmode)
{
    int err = 0;
    ConfReadBuffer confBuf;
    int pos = strlen(WorkModeParams_Marker);

    E(pre_set_config(&confBuf));
    memcpy(confBuf.workmodeparambuf, WorkModeParams_Marker, pos);
    SetNumU32(confBuf.workmodeparambuf + pos, wmode);
    E(set_config_to_flash(&confBuf));

FIN:
    return err;
}

void AppCustomParams_To_runtime_settings(AppCustomParams *pAppCusPara,
        ReaderRunTimeSettings_ST *runtime_set)
{
    int i;
    runtime_set->glob_params.hb_cylce = pAppCusPara->heart_beat_cylce;
    memcpy(runtime_set->glob_params.name, pAppCusPara->name, pAppCusPara->name_len);
    runtime_set->glob_params.name[pAppCusPara->name_len] = 0;
    runtime_set->glob_params.s_buf_size = 512;
    /*
    for (i = 0; i < 16; ++i)
    	runtime_set->inventory.ants[i] = 0;
    for (i = 0; i < pAppCusPara->invants_len; ++i)
    	runtime_set->inventory.ants[pAppCusPara->inv_ants[i]-1] = 1;

    runtime_set->inventory.cycle = pAppCusPara->inv_cycle;
    runtime_set->inventory.interval = pAppCusPara->interval_cycle;
    runtime_set->inventory.inv_mode = 0;

    runtime_set->tagfilter.is_tagfilter = pAppCusPara->is_tagfilter;
    if (pAppCusPara->is_tagfilter == 1)
    {
    	runtime_set->tagfilter.bank = pAppCusPara->tag_filter.bank;
    	runtime_set->tagfilter.mask_len = pAppCusPara->tag_filter.mask_len;
    	runtime_set->tagfilter.match = pAppCusPara->tag_filter.is_match;
    	memcpy(runtime_set->tagfilter.mask, pAppCusPara->tag_filter.mask, 64);
    	runtime_set->tagfilter.start = pAppCusPara->tag_filter.start_bit;
    }

    runtime_set->bankdata.is_bankdata = pAppCusPara->is_inv_bank_read;
    if ( pAppCusPara->is_inv_bank_read == 1)
    {
    	runtime_set->bankdata.bank = pAppCusPara->inv_bank_read.bank;
    	runtime_set->bankdata.blkcnt = pAppCusPara->inv_bank_read.blockcnt;
    	runtime_set->bankdata.start = pAppCusPara->inv_bank_read.start_block;
    	memcpy(runtime_set->bankdata.pwd, pAppCusPara->inv_bank_read.pwd, 4);
    }
    */
    runtime_set->cus_param.len = pAppCusPara->cusparam_len;

    if (pAppCusPara->cusparam_len > 0)
    {
        memcpy(runtime_set->cus_param.param, pAppCusPara->cusparam, 65);
        runtime_set->cus_param.param[pAppCusPara->cusparam_len] = 0;
    }

