deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_driver/projects/user/src/readercfg.c
    runtime_set->gpo_act.count = pAppCusPara->loc_gpo_act_count;

    for (i = 0; i < pAppCusPara->loc_gpo_act_count; ++i)
    {
        runtime_set->gpo_act.ids[i] = pAppCusPara->lga_gpo_id[i];
        runtime_set->gpo_act.states[i] = pAppCusPara->lga_gpo_states[i];
        runtime_set->gpo_act.durs[i] = pAppCusPara->lga_gpo_durs[i];
    }

    runtime_set->upload.sw_potl = Upload_Trans_Potl_Tcp;

    if (pAppCusPara->upload_ip[0] == 0)
    {
        runtime_set->upload.hw_inf = Upload_Inf_Uart_1;
        /*
        runtime_set->upload.inf_params.uart.baud = (pAppCusPara->upload_ip[1] << 16) |
        	(pAppCusPara->upload_ip[2] << 8) | pAppCusPara->upload_ip[3];
        runtime_set->upload.inf_params.uart.data_bits = 0;
        runtime_set->upload.inf_params.uart.stop_bits = 0;
        runtime_set->upload.inf_params.uart.parity = 0;
        runtime_set->upload.inf_params.uart.flow_ctrl = 0;
        */
        runtime_set->upload.crc_enable = 1;
    }
    else
    {
        runtime_set->upload.hw_inf = Upload_Inf_Ethernet;
        sprintf(runtime_set->upload.sw_potl_params.tcp.ser_ip, "%d.%d.%d.%d",
                pAppCusPara->upload_ip[0], pAppCusPara->upload_ip[1],
                pAppCusPara->upload_ip[2], pAppCusPara->upload_ip[3]);
        runtime_set->upload.sw_potl_params.tcp.ser_port = pAppCusPara->upload_port;
        runtime_set->upload.crc_enable = 0;
    }

    runtime_set->upload.client_ack = pAppCusPara->ack_client_mode;
    runtime_set->upload.data_aggr.mode = pAppCusPara->data_aggr_mode;
    runtime_set->upload.data_aggr.timeval = pAppCusPara->data_aggr_duration;

    if (pAppCusPara->event_count > 0)
        runtime_set->events.ids[runtime_set->events.count++] = rdr_rt_evt_GpiChange;

    runtime_set->gpi_trigger.is_gpi_trigger = pAppCusPara->is_gpi_trigger;

    if (pAppCusPara->is_gpi_trigger == 1)
    {
        runtime_set->gpi_trigger.mode = pAppCusPara->gpi_trigger_mode;
        runtime_set->gpi_trigger.timeval = pAppCusPara->gpi_read_timeout;
        runtime_set->gpi_trigger.cond_1.count = pAppCusPara->gpi_trigger1.gpi_count;

        for (i = 0; i < pAppCusPara->gpi_trigger1.gpi_count; ++i)
        {
            runtime_set->gpi_trigger.cond_1.ids[i] = pAppCusPara->gpi_trigger1.gpi_ids[i];
            runtime_set->gpi_trigger.cond_1.states[i] = pAppCusPara->gpi_trigger1.gpi_states[i];
        }

        if (pAppCusPara->gpi_trigger_mode == 1 || pAppCusPara->gpi_trigger_mode == 3
                || pAppCusPara->gpi_trigger_mode == 4)
        {
            runtime_set->gpi_trigger.cond_2.count = pAppCusPara->gpi_trigger2.gpi_count;

            for (i = 0; i < pAppCusPara->gpi_trigger2.gpi_count; ++i)
            {
                runtime_set->gpi_trigger.cond_2.ids[i] = pAppCusPara->gpi_trigger2.gpi_ids[i];
                runtime_set->gpi_trigger.cond_2.states[i] = pAppCusPara->gpi_trigger2.gpi_states[i];
            }
        }
    }
}

void dump_bluetooth_config(BluetoothConfig_ST *blest)
{
    #ifdef _DEBUG
    TRACE("dump_bluetooth_config start\n");
    TRACE("name:%s", blest->name);
    TRACE("pwd_pair:%d", blest->pwd_pair);
    TRACE("std_ble_pair:%d", blest->std_ble_pair);
    TRACE("pwd:%s", blest->pwd);
    TRACE("dump_bluetoothn_config end\n");
    #endif
}

void tojson_monet_config(MonetConfig_ST *monst,
                         char *jstart, int *len)
{
    sprintf(jstart, "{\"state\":%d,\"apn\":{\"enable\":%d,\"auth\":%d,\"cid\":%d,\"name\":\"%s\",\"user\":\"%s\",\"pwd\":\"%s\"}}",
            gMonetState, monst->apn.enable, monst->apn.auth, monst->apn.cid, monst->apn.name, monst->apn.user, monst->apn.pwd);
}

void tojson_bluetooth_config(BluetoothConfig_ST *blest,
                             char *jstart, int *len)
{
    sprintf(jstart, "{\"name\":\"%s\",\"std_ble_pair\":%d,\"pwd_pair\":%d,", blest->name,
            blest->std_ble_pair, blest->pwd_pair);
    sprintf(jstart + strlen(jstart), "\"mac\":\"%02X%02X%02X%02X%02X%02X\",", blest->mac[0],
            blest->mac[1], blest->mac[2], blest->mac[3], blest->mac[4], blest->mac[5]);

    if (blest->pwd_pair == 1)
        sprintf(jstart + strlen(jstart), "\"pwd\":\"%s\"}", blest->pwd);
    else
        sprintf(jstart + strlen(jstart) -1, "}");
}

void tojson_wlan_config(WlanConfig_ST *wlanst, char *jstart, int *len)
{
    sprintf(jstart, "{\"ip\":\"%d.%d.%d.%d\",", wlanst->ipinfo.ip[0],
            wlanst->ipinfo.ip[1], wlanst->ipinfo.ip[2], wlanst->ipinfo.ip[3]);
    sprintf(jstart + strlen(jstart), "\"nm\":\"%d.%d.%d.%d\",", wlanst->ipinfo.subnetMask[0],
            wlanst->ipinfo.subnetMask[1], wlanst->ipinfo.subnetMask[2], wlanst->ipinfo.subnetMask[3]);
    sprintf(jstart + strlen(jstart), "\"gw\":\"%d.%d.%d.%d\",", wlanst->ipinfo.gatewayIP[0],
            wlanst->ipinfo.gatewayIP[1], wlanst->ipinfo.gatewayIP[2], wlanst->ipinfo.gatewayIP[3]);
    sprintf(jstart + strlen(jstart), "\"dns\":\"%d.%d.%d.%d\",", wlanst->ipinfo.dnsServer[0],
            wlanst->ipinfo.dnsServer[1], wlanst->ipinfo.dnsServer[2], wlanst->ipinfo.dnsServer[3]);
    sprintf(jstart + strlen(jstart), "\"mac\":\"%02X%02X%02X%02X%02X%02X\",", wlanst->ipinfo.mac[0],
            wlanst->ipinfo.mac[1], wlanst->ipinfo.mac[2], wlanst->ipinfo.mac[3], wlanst->ipinfo.mac[4],
            wlanst->ipinfo.mac[5]);
    sprintf(jstart + strlen(jstart), "\"lport\":%d,", wlanst->ipinfo.listenPort);
    sprintf(jstart + strlen(jstart), "\"ssid\":\"%s\",\"mode\":%d,\"pwd\":\"%s\"}",
            wlanst->ssid, wlanst->mode, wlanst->pwd);

    *len = strlen(jstart);
}

int erase_monet_config(void)
{
    int err = 0;
    ConfReadBuffer confBuf;
    E(pre_set_config(&confBuf));
    memset(confBuf.monetcfgbuf, 0, 32);
    E(set_config_to_flash(&confBuf));
FIN:
    return err;
}

int set_monet_config(MonetConfig_ST *monst)
{
    int err = 0;
    ConfReadBuffer confBuf;
    int pos = strlen(MonetConfig_Marker);
    char *jstart;
    int jlen;
    E(pre_set_config(&confBuf));
    memcpy(confBuf.monetcfgbuf, MonetConfig_Marker, pos);
    jstart = (char *)confBuf.monetcfgbuf + pos + 2;

    tojson_monet_config(monst, jstart, &jlen);

